Repository: DenisLabrecque/Minesweeper-Basic
Catalog: FoxtroutGame/String/*/Resources.resw
Source language: en_ca
Languages: fr_ca

# aboutApp.Header
source: About
fr_ca: À propos

# averageGameTimeLabel.Text
source: Average Time
fr_ca: Temps moyen

# creditsLabel.Text
source: Credits
fr_ca: Crédits

# difficulty0.Content
source: Simplistic
fr_ca: Simplifié

# difficulty2.Content
source: Difficult
fr_ca: Difficile

# difficulty3.Content
source: Doctorate
fr_ca: Doctorat

# difficultySettingLabel.Text
source: Difficulty
fr_ca: Difficulté

# explosionNoiseCredit1.Text
source: Explosion noise by
fr_ca: Bruit d’explosion par

# fontsCredit1.Text
source: Fonts from
fr_ca: Police de texte

# fontsCredit3.Text
source: by myname5749
fr_ca: par myname5749

# fromTheProgrammerLabel.Text
source: From the Programmer
fr_ca: Mot du programmeur

# gameDisplayName.Text
source: Minesweeper
fr_ca: Démineur

# gameGoalLabel.Text
source: Goal of the Game
fr_ca: But du jeu

# gameGoalParagraph.Text
source: Reveal all the empty tiles without hitting any mine.
fr_ca: Révélez toutes les cases vides sans toucher aucune mine.

# gameSizeSettingLabel.Text
source: Game Size
fr_ca: Grandeur du jeu

# gamesLostLabel.Text
source: Games Lost
fr_ca: Jeux perdus

# gamesPlayedLabel.Text
source: Games Played
fr_ca: Jeux joués

# AppName
source: Minesweeper Basic
fr_ca: Démineur Éssentiel

# gamesWonLabel.Text
source: Games Won
fr_ca: Jeux gagnés

# gameTab.Header
source: Game
fr_ca: Jeu

# historyLabel.Text
source: Minesweeper History
fr_ca: Histoire du jeu

# historyParagraph1.Text
source: Curt Johnson, a programmer hired by Microsoft, wrote a game whose objective was to get through a minefield from one corner to the other, in 1998. Robert Donner, a work colleague, used this code to make his own weekend version of the game, dubbed “Mine.” This game was gradually tweaked and passed along among work colleagues.
fr_ca: En 1998, Curt Johnson, programmeur Microsoft, écrivit un jeu qui avait pour objectif d’aller d’un coin à l’autre d’un champ de mines. Robert Donner, son collègue de travail, utilisa ce code pour en faire sa propre version du jeu, appelée “Mine,” en fin de semaine. Ce jeu fut graduellement modifié et échangé entre employés.

# historyParagraph2.Text
source: In 1990, Microsoft programmers were invited to submit games for Windows 3.0, and “Mine,” now also known as “Winmine,” was accepted. With retouched graphics and a new name, Minesweeper would become famous in 1992, when it was included in Windows 3.2 along with Solitaire. It would then become part of Windows 95, Windows 98, Windows 2000, Windows XP, Windows Vista, and Windows 7.
fr_ca: En 1990, les programmeurs Microsoft furent invités à soumettre des jeux pour Windows 3.0, et “Mine,” maintenant aussi connu sous le nom de “Winmine,” fut accepté. Avec des graphiques retouchés et un nouveau nom, Minesweeper devint bien connu: en 1992, le jeu fut inclus dans Windows 3.2, ainsi que Solitaire. Il ferait dès lors partie de Windows 95, Windows 98, Windows 2000, Windows XP, Windows Vista, et Windows 7.

# numberOfMines.ToolTipService.ToolTip
source: Number of mines
fr_ca: Nombre de mines

# programmerParagraph1.Text
source: Hi! I’m
fr_ca: Bonjour! Je suis

# programmerParagraph2.Text
source: a Canadian student in Computer Information Systems and Graphic Design at
fr_ca: un étudiant canadien en programmation et design graphique à

# programmerParagraph3.Text
source: This course of study led me to recreate Minesweeper as a final project in C# programming using the .NET framework.
fr_ca: Ces cours m’ont mené à récréer Minesweeper comme projet final en programmation .NET avec C#.

# programmerParagraph4.Text
source: Making a functional draft of the game took me a day. However, getting the win situation to register correctly took further work. The most difficult part of programming this game was creating the method to reveal connected blank tiles. I had to rewrite it on a fresh mind, and this took three and a half hours while working based on previous knowledge.
fr_ca: Bâtir un projet fonctionnel du jeu m’a pris seulement un jour. Cependant, faire fonctionner la situation gagnante a pris un peu plus de travail. La partie la plus difficile de la programmation de ce jeu a été de créér la méthode qui révèle les carreaux vides aux côtés adjacents. J’ai du la réécrire avec un esprit reposé, et cela m’a pris trois heures et demi de travail, même avec mon expérience précédente.

# restartGameLabel.Text
source: Ready
fr_ca: Prêt

# rulesLabel.Text
source: Rules
fr_ca: Règles

# rulesParagraph.Text
source: The first click is always safe; a number of mines per number of tiles is then randomly distributed based on the difficulty setting. Numbered tiles show how many mines touch them at the edges or corners. Clicking a blank tile reveals all connected blank tiles at once. Hitting a mine is an immediate loss, but revealing all tiles that are not mines is a win.
fr_ca: Le premier clic est toujours une case vide; un certain nombre de mines est alors distribué au hazard selon la difficulté choisie et la grandeur de la grille. Les cases numérotées avertissent du nombre de mines qu’ils touchent du rebord ou du coin. Cliquer une case vide révèle d’un coup toutes les cases connectées. Cliquer une mine est un échet immédiat, mais de révéler toutes les cases vides ou numérotées est un succès.

# sessionStatistics.Header
source: Results
fr_ca: Résultâts

# tilesRevealed.ToolTipService.ToolTip
source: Tiles revealed
fr_ca: Tuiles révélées

# timeIndicator.ToolTipService.ToolTip
source: Time since game start
fr_ca: Temps depuis le début du jeu

# winNoiseCredit1.Text
source: Jingle Win sound by
fr_ca: Son Jingle Win par

# underCC.Text
source: under Creative Commons Attribution
fr_ca: sous attribution Creative Commons

# restartButton.Content
source: Restart
fr_ca: Recommencer

# startButton.Content
source: Start
fr_ca: Commencer

# newBadgeEarned.Text
source: New badge earned!
fr_ca: Objectif réussi!

# objectiveBadgesTitle.Text
source: Objective Badges
fr_ca: Objectifs

# reveal10000ObjectiveDescription
source: Reveal 10 000 tiles in games you win.
fr_ca: Révèle 10 000 cases dans des jeux gagnés.

# reveal10000ObjectiveTitle
source: Blessed
fr_ca: Béni

# reveal1000ObjectiveDescription
source: Reveal 1 000 tiles in games you win.
fr_ca: Révèle 1 000 cases dans des jeux gagnés.

# reveal1000ObjectiveTitle
source: Chicklet
fr_ca: Poussin

# reveal100ObjectiveDescription
source: Reveal 100 tiles in games you win.
fr_ca: Révèle 100 cases dans des jeux gagnés.

# reveal100ObjectiveTitle
source: Bud
fr_ca: Bourgeon

# winDifficultObjectiveDescription
source: Win a game in the ‘Difficult’ setting. The game must be a minimum size of 10.
fr_ca: Gagne un jeu sur ‘Difficile.’ Le jeu doit avoir une taille minimale de 10 cases.

# winDifficultObjectiveTitle
source: Professional
fr_ca: Professionnel

# winDoctorateObjectiveDescription
source: Win a game in the ‘Doctorate’ setting. The game must be a minimum size of 10.
fr_ca: Gagne un jeu sur ‘Doctorat.’ Le jeu doit avoir une taille minimale de 10 cases.

# winDoctorateObjectiveTitle
source: Scholar
fr_ca: Érudit

# winSaturationObjectiveDescription
source: Win a game in the ‘Saturation’ setting. The game must be a minimum size of 10.
fr_ca: Gagne un jeu sur ‘Saturation.’ Le jeu doit avoir une taille minimale de 10 cases.

# winSingleClickObjectiveDescription
source: Win any game in just one click.
fr_ca: Gagne un jeu en un seul clic.

# winSingleClickObjectiveTitle
source: Pure Luck
fr_ca: Pure Chance
